{
    "before-pa": {
        "narrative-text-1": "I've made it just as the sun is setting.",
        "narrative-text-2": "I can see my whānau.",
        "narrative-text-3": "I can smell the kai.",
        "narrative-text-4": "It's great to be home.",
        "next-stage-button": "Approach the pā"
    },
    "landscape-view": {
        "line-1": "After a long time away, I'll finally return home to my whānau.",
        "line-2": "I've been travelling for days now, but the pā is just at the end of this valley.",
        "line-3": "I'll need to cross the plains...",
        "line-4": "...and a river...",
        "line-5": "...but first I have to find the correct path through the forest.",
        "line-6": "My whanau told me I will come across a secret message: Which rimu tree to look for to find the river crossing.",
        "line-7": "Not far to go now...",
        "next-stage-button": "Step into the forest"
    },
    "fern-interactive": {
        "intro-line-1": "A group of fern leaves has been laid upon a large rock.",
        "intro-line-2": "This must be related to the secret message my whānau told me about to find the river crossing.",
        "intro-line-3": "I should understand what is special about these leaves before continuing.",
        "instruction-text": "Click on the fern leaves to interact with them.",
        "ant-hint": "The ants are forming a number on the tree that seems to be connected to the leaves. I should understand how the numbers are formed.",
        "task-1": "How do I make the number {{number}}?",
        "task-2": "Ahh, that worked. What about the number {{number}}?",
        "final-text": "I think it's time to head further down the path now.",
        "next-stage-button": "Continue down the path"
    },
    "fern-message": {
        "previous-stage-button": "Go back up the path",
        "check-button": "Check the letters",
        "initial-text-1": "I've found the secret message hanging on a rimu trunk. Some of the dots have been rubbed off the leaves to make it harder to decipher.",
        "initial-text-2": "I need to figure out what the word is, so I know which path to take down the valley to the river crossing.",
        "initial-text-3": "I need to figure out the letters – represented by the ferns – using the symbols on the fallen log below. The resulting word should tell me which path to take.",
        "hint-text": "If I don't understand how the code works I might need to head back up the path. Maybe the fern leaves and the number the ants formed can help me.",
        "correct-text": "{{word}} = {{translation}}",
        "incorrect-text": "Something doesn't seem right. I need to try again.",
        "final-text": "Ah! Since the number has appeared on a rimu tree, I will continue down the track until I pass {{word}} rimu. I can head downhill to the river at that point, and I should find the river crossing.",
        "next-stage-button": "Head down the valley"
    },
    "before-river": {
        "initial-text-1": "Whew! I'm glad to have figured out that message left for me by my whānau. I have successfully found the secret path and made it to the river.",
        "initial-text-2": "That storm last week has washed away the crossing. The river is too swift to cross, so I'm going to have to make a new bridge. At least by rebuilding the bridge, other people will be able to use it too.",
        "initial-text-3": "I can see some spare coils of rope, but the individual lengths are too short to span the river. I'm going to have to join them together.",
        "next-stage-button": "Start assembling the bridge"
    },
    "river-crossing": {
        "initial-text": "I'm going to have to join these coils of rope together. Which lengths will I join to make three perfect spans of rope?",
        "instruction-text": "Drag the coils of rope to the river. Make sure they aren't too long or too short. Drag them back to the river bank if you need to.",
        "final-text": "I managed to make three perfect spans of rope, creating a bridge for me to cross. Not far to go now. I can smell the wood-smoke from the pā.",
        "hint-button": "Help! Start the bridges for me...",
        "next-stage-button": "Cross the river"
    },
    "before-plains": {
        "initial-text-1": "I can see the pā in the distance, but I still need to cross the large grassy plains.",
        "initial-text-2": "There are obstacles everywhere. I can see where some weka have built their nests, I don't want to disturb them either. How will I find my way through?",
        "next-stage-button": "Start walking"
    },
    "plains": {
        "initial-text": "My whānau have left instructions for me, but some of the instructions were lost in the storm. I can replace them from this pile of spares.",
        "instruction-text": "Drag steps from the pile of spares, to create a set of instructions to reach the path at the top.",
        "kea-text": "Oh no! That kea has taken all the right arrows! I'll have to complete the instructions without them. I have plenty of space for instructions, but I don't think I'll need to use them all.",
        "hint-text": "There isn't enough room for all the instructions. There must be a quicker way to get through with the blocks I have. I wonder if I need to think creatively about how I use the arrows...",
        "run-button": "Run instructions",
        "next-stage-button": "Continue walking across the plains"
    },
    "complete": {
        "final-text-1": "Ko te kairapu ko ia te kite\nThe one who seeks will find",
        "final-text-2": "Tino pai! Well done on making it to your destination by completing the puzzles.",
        "final-text-3": "The three types of puzzles that you completed on your journey are all examples of important concepts that are in the new and revised Digital Technologies and Hangarau Matihiko curriculum content.",
        "final-text-4": "Scroll down to learn more.",
        "forest-puzzle-heading": "Forest Message",
        "forest-image": "screenshot-en-forest.png",
        "forest-puzzle-text": "<p>The puzzle with the silver ferns gets to the heart of why use the word \"digital\" when talking about digital devices, digital photos, digital natives and so on! The activity shows how messages are stored or transmitted digitally using just two values.</p><p>In the puzzle the two values were the green and silver side of the ferns, but on digital devices we often refer to the two values as the digits 0 and 1, and these are the \"digits\" that being digital is all about. Representing text (or pictures, or sound, or video, or anything else) using this idea is called \"binary representation\", and you’ll find it in <a href='https://nzcurriculum.tki.org.nz/The-New-Zealand-Curriculum/Technology/Progress-outcomes#collapsible1' target='_blank'>Progress Outcomes 3, 4, and 5 in Computational Thinking for Digital Technologies.</a></p>",
        "forest-puzzle-resources-heading": "Want to learn more about binary numbers?",
        "forest-puzzle-resources": "<li><a href='https://getready.iqualify.com/home' target='_blank'>Kia Takatū ā-Matihiko - Pīkau 15</a></li><li><a href='https://csfieldguide.org.nz/en/chapters/data-representation/numbers/' target='_blank'>Computer Science Field Guide - Binary Numbers</a></li>",
        "forest-puzzle-button": "Link to fern puzzle",
        "river-puzzle-heading": "River Crossing",
        "river-image": "screenshot-en-river.png",
        "river-puzzle-text": "<p>The river crossing puzzle where you joined rope lengths is an example of a common problem that computer scientists still haven’t figured out how to solve efficiently on a computer! For a small number of pieces of rope, a computer program can just try out lots of possibilities, but once you get a decent number of pieces, the time taken grows exponentially - even a fast computer can take thousands of years to try out all the possibilities.</p><p>The general problem is called \"bin packing\", and it comes up when we’re trying to load freight onto vehicles with a limited capacity, or cut up lengths of steel to particular sizes. You’d think someone could find a fast algorithm to work out the best solution, but no-one has, even though there’s a million dollar prize for finding a solution.</p><p>There are hundreds of problems like this that are referred to as \"intractable\" - they take too long for computers to solve. You’ll find the topic of tractability in <a href='https://nzcurriculum.tki.org.nz/The-New-Zealand-Curriculum/Technology/Progress-outcomes#collapsible1' target='_blank'>Progress Outcome 7 in Computational Thinking for Digital Technologies</a> - it’s usually explored in NCEA level 2.</p>",
        "river-puzzle-resources-heading": "Want to learn more about bin packing?",
        "river-puzzle-resources": "<li><a href='https://getready.iqualify.com/home' target='_blank'>Kia Takatū ā-Matihiko - Pīkau 17</a></li><li><a href='https://csfieldguide.org.nz/en/chapters/complexity-and-tractability/bin-packing-problem/' target='_blank'>Computer Science Field Guide - Bin packing problem</a></li>",
        "river-puzzle-button": "Link to river crossing puzzle",
        "plains-puzzle-heading": "Navigating Plains",
        "plains-image": "screenshot-en-plains.png",
        "plains-puzzle-text": "<p>The final puzzle, moving around on the grid using simple forward/left/right commands, is a popular way to introduce the idea of computer programming (or \"coding\" as it’s sometimes referred to). While moving on a grid isn’t a proper programming language, it provides a vocabulary of unambiguous instructions that gives students experience giving commands that will be followed precisely, and allows them to test if they work correctly.</p><p>When the instructions don’t do what was intended, students need to develop the resilience to track down what is wrong (a \"bug\"), and try again with revised instructions. The idea of breaking \"simple non-computerised tasks into precise, unambiguous, step-by-step instructions\" and \"simple debugging\" comes from <a href='https://nzcurriculum.tki.org.nz/The-New-Zealand-Curriculum/Technology/Progress-outcomes#collapsible1' target='_blank'>Progress Outcome 1 in Computational Thinking for Digital Technologies</a>.</p>",
        "plains-puzzle-resources-heading": "Want to learn more about coding and kidbots?",
        "plains-puzzle-resources": "<li><a href='https://getready.iqualify.com/home' target='_blank'>Kia Takatū ā-Matihiko - Pīkau 5, 6, and 7</a></li><li><a href='https://csunplugged.org/en/topics/kidbots/unit-plan/' target='_blank'>CS Unplugged - Kidbots</a></li>",
        "plains-puzzle-button": "Link to plains puzzle",
        "thanks": "Thanks for joining us on this digital journey.<br>If you solved the puzzles, then you’ve engaged with some of the biggest ideas in computing!",
        "try-puzzle-again": "Want to try the puzzle again?"
    },
    "main": {
        "browser-note": "A Google Chrome or Mozilla Firefox browser is required.",
        "browser-recommend": "Try using a browser such as Google Chrome or Firefox that is up to date.",
        "credit": "This website was produced through funding from the <a href='https://www.education.govt.nz/' target='_blank'>Ministry of Education</a> for the National Digital Readiness Programme, <a href='https://kiatakatu.ac.nz/' target='_blank'>Kia Takatū ā-Matihiko</a>. It is hosted and maintained by the <a href='https://www.canterbury.ac.nz/' target='_blank'>University of Canterbury</a>, <a href='https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/' target='_blank'>Computer Science Education Group</a>. This website content is available under <a href='https://creativecommons.org/licenses/by-sa/4.0/' target='_blank'>Creative Commons BY-SA 4.0</a>, and the interactive website is licensed under the <a href='https://tldrlegal.com/license/mit-license' target='_blank'>MIT license</a>. Any third party libraries used have their licenses listed in the <a href='https://github.com/uccser/dt-puzzle-journey' target='_blank'>GitHub repository</a>. The Kia Takatū ā-Matihiko logo is under <a href='https://www.iponz.govt.nz/about-ip/copyright/crown-copyright/' target='_blank'>New Zealand Crown copyright</a>. Bird sounds used in the sound files are from the <a href='https://www.doc.govt.nz/nature/native-animals/birds/bird-songs-and-calls/0' target='_blank'>Department of Conservation (New Zealand)</a> and are under <a href='https://www.iponz.govt.nz/about-ip/copyright/crown-copyright/' target='_blank'>New Zealand Crown copyright</a>, and are used with permission.",
        "landscape": "Please use your device in landscape mode.",
        "length": "This experience takes roughly 10 to 20 minutes to complete.",
        "problem": "Sorry, but we've encountered a problem.",
        "setup": "Getting everything setup...",
        "sound": "We recommend turning sound on.",
        "start-before-river": "Start at the river",
        "start-fern-interactive": "Start at the fern leaves",
        "start-fern-message": "Start at message in ferns leaves",
        "start-landscape-view": "Start the journey",
        "start-pa": "Start at the pā",
        "start-plains": "Start at the plains",
        "start-river": "Start at the river crossing",
        "title": "A DT Puzzle Journey",
        "change-language": "Whakawhiti ki te reo Māori",
        "volume": "Volume"
    }
}
