{
    "before-pa": {
        "narrative-text-1": "Kua tae atu ahau i te tōnga o te rā.",
        "narrative-text-2": "Kua kite ahau i tōku whānau.",
        "narrative-text-3": "Te kakara pai o te kai.",
        "narrative-text-4": "Inā te koa ki te hoki ki te kāinga.",
        "next-stage-button": "Whakatata atu ki te pā"
    },
    "landscape-view": {
        "line-1": "Taku roa ki wāhi kē, kua hoki rā anō ahau ki te kāinga, ki tōku whānau.",
        "line-2": "Te maha o ngā rā o taku haerenga, nāwai rā, kei te pito o tēnei whārua te pā.",
        "line-3": "Me whakawhiti ahau i ngā mānia...",
        "line-4": "...me te awa...",
        "line-5": "...engari, tuatahi, me kimi ahau i te ara tika kia puta i te ngāhere.",
        "line-6": "Ko te kōrero o tōku whānau, ka kite ahau i te tohu muna: kei tēhea o ngā rākau rimu te whakawhitinga awa.",
        "line-7": "Kāore i te roa ināianei...",
        "next-stage-button": "Uru ki te ngahere"
    },
    "fern-interactive": {
        "intro-line-1": "Kua takoto tētahi huinga rau huruwhenua ki runga i tētahi toka.",
        "intro-line-2": "Te āhua nei ko te karere muna tēnei, i kōrerohia e tōku whānau, te tohu mō te whakawhitinga awa.",
        "intro-line-3": "Me kimi māramatanga ahau ki te āhua motuhake o ēnei rau i te tuatahi, kātahi ka haere tonu atu.",
        "instruction-text": "Pāwhiria ngā rau huruwhenua ki te tūhura i ngā āhuatanga.",
        "ant-hint": "Kei te waihanga ngā pōpokorua i tētahi nama kei runga i te rākau nei, te āhua nei kei te hāngai ki ngā rau. Kei te tipu taku māramatanga ki te tikanga o aua nama.",
        "task-1": "Me pēhea ahau te nama {{number}} e hanga?",
        "task-2": "Ka pai tērā. Pēhea te nama {{number}}?",
        "final-text": "Kua rite ināianei kia haere tonu atu i te ara.",
        "next-stage-button": "Whāia tonutia te ara"
    },
    "fern-message": {
        "previous-stage-button": "Me hoki anō mā te ara",
        "check-button": "Āta tirotirohia ngā reta",
        "initial-text-1": "Kua kite ahau i te karere muna, e iri ana i te tīwai rimu. Kua ūkuia ētahi o ngā ira i ngā rau, kua uaua ināianei te whakamatara he aha te tikanga.",
        "initial-text-2": "Me kimi au i te tikanga o te kupu, kia mōhio ai au ko tēhea te ara tika whakararo ki te whārua, ki te whakawhitinga awa.",
        "initial-text-3": "Ka kimi ahau i te tikanga o ngā reta – kua whakaaturia ki ngā rau huruwhenua – mā te whakamahi i ngā tohu kei runga i te poro rākau e takoto nei. Mā te kupu ka whākina mai au e mōhio ko tēhea te ara.",
        "hint-text": "Ki te kore ahau e mārama ana ki tēnei waehere, tērā pea me hoki ahau i te ara. Mā ngā rau huruwhenua me ngā nama i hangaia e ngā popokorua pea au e āwhina.",
        "correct-text": "{{word}}",
        "incorrect-text": "Kāore anō kia tika. Ka whakamātau anō ahau.",
        "final-text": "Ka pai! Nā te mea kua puta te nama ki runga i te rimu, ka haere tonu ahau i te ara kia whakawhiti ahau i ngā rimu e {{word}}. Kātahi ka heke ahau ki te awa, kia kite ai ahau i te whakawhitinga awa.",
        "next-stage-button": "Heke ki raro ki te whārua"
    },
    "main": {
        "browser-note": "Me whakamahi tētahi o ngā pūtirotiro nei: te Google Chrome, te Mozilla Firefox rānei.",
        "browser-recommend": "Whakamātauria tētahi pūtirotiro kē, pērā ki te Google Chrome, te Firefox rānei kua whakahoungia.",
        "credit": "I whakaputaina tēnei paetukutuku nā te pūtea a te Tāhuhu o te Mātauranga, mō te National Digital Readiness Programme, Kia Takatū ā-Matihiko. Kua purutia, kua whakahaerehia e te University of Canterbury, Computer Science Education Group. E tukuna ai ngā ihirangi o te paetukutuku kei raro i te Creative Commons BY-SA 4.0, ā, ko te paetukutuku pāhekoheko nei kei raro i te raihana MIT. Ka kitea hoki ngā raihana o ngā putunga tuhiwaehere o te tangata kē kei roto i te putunga GitHub. Ka noho te waitohu o Kia Takatū ā-Matihiko me ngā rauemi o te kaupapa nei kei raro i te manatārua a te Karauna.",
        "landscape": "Tēnā whakamahi i tāu pūrere kia nohopae.",
        "length": "Kei te rohe o te 10 ki te 20 miniti te wā ki te whakaoti i tēnei kaupapa.",
        "problem": "Aroha atu! Kua puta mai he raru.",
        "setup": "Kei te whakariterite...",
        "sound": "Me whakakā pea te puoro",
        "start-before-river": "Tīmatahia mai i te awa",
        "start-fern-interactive": "Tīmatahia mai i ngā rau huruwhenua",
        "start-fern-message": "Tīmatahia mai i te karere ā-rau huruwhenua",
        "start-landscape-view": "Tīmatahia te haerenga",
        "start-pa": "Tīmatahia mai i te pā",
        "start-plains": "Tīmatahia mai i ngā mānia",
        "start-river": "Tīmatahia mai i te whakawhitinga awa",
        "title": "He Haerenga Panga HM"
    }
}
